In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv("50_states.csv")

In [5]:
df.head()

        state    x    y
0     Alabama  139  -77
1      Alaska -204 -170
2     Arizona -203  -40
3    Arkansas   57  -53
4  California -297   13

In [6]:
df["state"] = df["state"].apply(lambda x:x.lower())

In [8]:
df.head()

        state    x    y
0     alabama  139  -77
1      alaska -204 -170
2     arizona -203  -40
3    arkansas   57  -53
4  california -297   13

In [12]:
df.to_csv("50_states.csv",index=False)